# Requires Homebrew: https://brew.sh/
# Run "brew bundle install" to install all of these apps and packages

# tap 
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Mac App Store
mas "AVG Cleaner", id: 667434228
mas "Batter Monitor: Health, Info", id: 836505650
# Blocked on SH network:
mas "Day One", id: 1055511498
mas "HiddenMe", id: 467040476
mas "Flycut", id: 442160987
mas "KeyNote", id: 409183694
# Blocked on SH network:
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Memory Clean", id: 451444120
# Make sure you have an active Office365 license for these:
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Simplenote", id: 692867256
# Blocked on SH network:
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835

# brew
brew "mas"
brew "docker"
brew "git"
# Make sure node/npm/nvm versions are installed properly:
# nvm should install the current version of node automatically:
brew "nvm"
#brew "node"
# Requires the Java JDK: https://www.oracle.com/technetwork/java/javase/downloads/index.html:
brew "maven"
brew "openshift-cli"
brew "python"
brew "swiftlint"
brew "zsh"

# Using cask requires having agreed to the Xcode license first. Run this manually in Terminal:
# sudo xcodebuild -license accept

# cask
cask "aerial"
cask "airtable"
# Alfred settings: macOS dark appearance.
cask "alfred"
cask "appcleaner"
cask "android-studio"
# (By Brett Terpstra):
cask "bunch"
# cask "brackets"
# cask "cheatsheet"
cask "coconutbattery"
cask "discord"
cask "dropbox"
# cask "dbeaver-community"
cask "firefox"
cask "flotato"
cask "flux"
# Blocked on SH network:
cask "google-backup-and-sync"
cask "google-chrome"
# Switch to "intellij-idea" for the enterprise version:
cask "intellij-idea-ce"
cask "keyboard-maestro"
cask "mark-text"
cask "omnidisksweeper"
cask "postman"
# Switch to "pycharm" for the enterprise version:
cask "pycharm-edu"
# cask "quitter"
cask "rescuetime"
# keyboard shortcut set to "~":
cask "rocket"
# set settings to reverse for mouse but not trackpad:
cask "scroll-reverser"
cask "selfcontrol"
# please no
cask "soapui"
cask "sourcetree"
cask "spotify"
cask "teamviewer"
# VS Community 2017
# This didn't seem to install .NET Core options, so I had to install the app manually: https://visualstudio.microsoft.com/vs/mac/net/
cask "visual-studio"
cask "visual-studio-code"
